#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-gvmiH2zNEpmo9Tua

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_eip.external_composer_lb_elastic_ip: Refreshing state... [id=eipalloc-056acc0ea7b12456f]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=external_composer_syslog]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_lb_target_group.external_composer: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:933752197999:targetgroup/external-composer/9fe753c7237a096c]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_instance.composer_internal: Refreshing state... [id=i-0a68c4943aff51cfe]
aws_instance.composer_external: Refreshing state... [id=i-08e50f4484ed22b9a]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-2907417618]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-3b3c9647-29f2-4dbd-be71-26305028634c]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-1173148770]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-04e6df10bd74694e7]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-dc578ae3-3d2d-4c48-96b9-699f00ab7cb4]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-08e50f4484ed22b9a" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-08e50f4484ed22b9a" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      ~ key_name                     = "obudai" -> (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-35-174-19-194.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "35.174.19.194" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data                    = "e1c3a2ba7d051ebcebe8d60f0d835ff5c1716fa1" -> "2bb264aea411f9b6b8f683498f52b9b51e7a7fd6" # forces replacement
      - volume_tags                  = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "🏗 External Composer (staging)"
          - "ServiceOwner" = "Image Builder"
        } -> null
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0aa402959b890ec2e" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0a68c4943aff51cfe" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0a68c4943aff51cfe" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      ~ key_name                     = "obudai" -> (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data                    = "e1c3a2ba7d051ebcebe8d60f0d835ff5c1716fa1" -> "2bb264aea411f9b6b8f683498f52b9b51e7a7fd6" # forces replacement
      - volume_tags                  = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "🏗 Internal Composer (staging)"
          - "ServiceOwner" = "Image Builder"
        } -> null
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0bad1afe96bfc928d" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 5 -> (known after apply)
        id                      = "lt-04e6df10bd74694e7"
      ~ latest_version          = 5 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTcyLjMxLjY0LjExCk9TQlVJTERfQ0FfQ0VSVD1MUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VSRVZFTkRRV1pYWjBGM1NVSkJaMGxWVUROUU0yWXpOVkJHVWs1MWIyWjBlbU01VERrMlJHaFViMlJCZDBSUldVcExiMXBKYUhaalRrRlJSVXdLUWxGQmQwWnFSVlZOUWtsSFFURlZSVUYzZDB4aU0wNXBaRmRzYzFwRE5YWmpiV04zU0doalRrMXFRWGRQVkVWNlRWUlplVTFFVlROWGFHTk9UWHBCZHdwUFZFVjRUVlJaZVUxRVZUTlhha0ZYVFZKUmQwVm5XVVJXVVZGRVJFRjBkbU15U2pGaFYzaHJURzA1ZVZwNlEwTkJVMGwzUkZGWlNrdHZXa2xvZG1OT0NrRlJSVUpDVVVGRVoyZEZVRUZFUTBOQlVXOURaMmRGUWtGTlFuQnJXVkZZU1ZOTVl6aExXV3BOVVZsbmVuQlJPVU5CTTFKTE1tZElSREJ4WVhGemRqZ0tZVkpqVmtNMk5sTTVaa2h4UlVVeGFVeFZXRTgzTURKUmVqVnphMnBvTTNweFRIbEhVamgzVWxZdkwyTkpNV0l4Y2pCVmVWcFRZMHhhTTFjM1ZWcHlRd28wTkRSbVkzb3pUWGw0YkZONlYxVlpVMUJuUWtsTGFHZEJPSEZ0Y2xwU01XOW1ZV1J5ZUhWU1RDdHpia1pFU1d0NE0zY3JZekZLWlZWdU1tTnNNRmRwQ2xWMFdESkhSMVpEUmxkTlQyRnZaa1JyV0ZWRFJuVkxTSGRLVVdkR1RIUnpTRU5hV1dObWRsZFdTRnBhTms0NGQwZHdNbEZhV1RJNVl6aDFiWEJxTVZBS1VFWnNXRU00WkdGYVRFMWhXRmxpUlRCTlNYUldNRU5JU25CM1IwbHdZbmx1YlZsVWJDdHpSblYyYkRSdlZHMXllSG92ZVhoNmNFUjJWazFQY2tGSmJRcDRiMnMzY2xWdFZIVmtSR1ZGVTFKQ1QyZEJNVXQxWVUxU1ZIVmhTWEJSYnpKa2IzWnhLekF4Um1ZelFVNHlWVU5CZDBWQlFXRk9WRTFHUlhkSVVWbEVDbFpTTUU5Q1FsbEZSa28zWlRaWU0za3daRzlzY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFDT0VkQk1WVmtTWGRSV1UxQ1lVRkdTamRsTmxnemVUQmtiMndLY1M5S1lsWnBZa2xwZDJSdVUxQXJOazFCT0VkQk1WVmtSWGRGUWk5M1VVWk5RVTFDUVdZNGQwUlJXVXBMYjFwSmFIWmpUa0ZSUlV4Q1VVRkVaMmRGUWdwQlJucDJOMmxsUzBjNWJGcExja0l5VFcxYWFFRnhTRWxNZVd4aFQzbFdjVGMzUnpsQ1RWSlVSbk53V25VME1ISTNSMVIzWTBSb2RtZzFSVU52U0ZGaUNteHJkVEJZTlU5WVowUjJXSE5DY0c5R1NISjJNRXRQU1d4VE4xVktNWFl3TkdzdlNsbG5XSGNyYkdwVVZITXZPWHB3YmpoU1ZteHRjSFV2UjAxUFRUVUtVV0pIVUN0T2FqVmFjelZtUjBaWGFFNDNUVEkxVVd0Vk9ESktiSGhsU2tGc1VYaElRMnhEVUdWNFVrTk5ZVEY1TlhBM1ZHNW5PREJMU2xkMGVWQlFPUXAwVTJkTlFuQTNOVlZTWlc4ME5VVTRVRXB5U25BemFIbHZORko0T1ZKUlIydHllV05TU1hkbVFraDJhM2hOU21adWMyTTNXUzkyTldsMVJqaHRlRTE2Q2pOMFlrbzVLMHA1UlVGMVNIb3hZa2QxY1VOWUszRktVVlJVZEM5UmJ6WXlka2RYWVVrNVUxWkxZbE00WVZoTVF6Sk9ObkZqYVdKeGNqVTRaalJFU2tRS1NuTnNUUzgzY0hONWNqRnZOWFIwWWtKdU5sazFRWE05Q2kwdExTMHRSVTVFSUVORlVsUkpSa2xEUVZSRkxTMHRMUzBLCldPUktFUl9TU0xfS0VZU19BUk49YXJuOmF3czpzZWNyZXRzbWFuYWdlcjp1cy1lYXN0LTE6OTMzNzUyMTk3OTk5OnNlY3JldDpicmV3X2tleXMtN0ZVZWVsCgojIFZhcmlhYmxlcyBmb3IgdGhlIHNjcmlwdC4KQ09NUE9TRVJfRElSPS9ldGMvb3NidWlsZC1jb21wb3NlcgoKIyBBZGQgbWhheWRlbidzIFNTSCBrZXkgdGVtcG9yYXJpbHkuCmN1cmwgaHR0cHM6Ly9naXRodWIuY29tL21ham9yLmtleXMgPj4gL2hvbWUvZWMyLXVzZXIvLnNzaC9hdXRob3JpemVkX2tleXMKCiMgU2V0IHVwIC9ldGMvaG9zdHMKIyBUT0RPKG1oYXlkZW4pOiBXZSBuZWVkIHRvIGNvbnZlcnQgdGhpcyB0byBETlMgbGF0ZXIgd2hlbiB3ZSBsYXVuY2guCmNhdCA8PDwgIiR7Q09NUE9TRVJfQUREUkVTU30gJHtDT01QT1NFUl9IT1NUfSIgPj4gL2V0Yy9ob3N0cwoKIyBEZXBsb3kgdGhlIGNvbXBvc2VyIENBIGNlcnRpZmljYXRlLgpta2RpciAke0NPTVBPU0VSX0RJUn0KYmFzZTY0IC1kIC0gPDw8ICR7T1NCVUlMRF9DQV9DRVJUfSA+ICR7Q09NUE9TRVJfRElSfS9jYS1jcnQucGVtCgojIERlcGxveSB0aGUgY29tcG9zZXIga2V5IGFuZCBjZXJ0aWZpY2F0ZS4KL3Vzci9sb2NhbC9iaW4vYXdzIHNlY3JldHNtYW5hZ2VyIGdldC1zZWNyZXQtdmFsdWUgXAogIC0tc2VjcmV0LWlkICR7V09SS0VSX1NTTF9LRVlTX0FSTn0gfCBqcSAtciAiLlNlY3JldFN0cmluZyIgPiAvdG1wL3dvcmtlcl9rZXlzLmpzb24KanEgLXIgIi53b3JrZXJfa2V5IiAvdG1wL3dvcmtlcl9rZXlzLmpzb24gfCBiYXNlNjQgLWQgLSA+ICR7Q09NUE9TRVJfRElSfS93b3JrZXIta2V5LnBlbQpqcSAtciAiLndvcmtlcl9jcnQiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1jcnQucGVtCnJtIC1mIC90bXAvd29ya2VyX2tleXMuanNvbgoKIyBQcmVwYXJlIG9zYnVpbGQtY29tcG9zZXIncyByZW1vdGUgd29ya2VyIHNlcnZpY2VzIGFuZCBzb2NrZXRzLgpzeXN0ZW1jdGwgZW5hYmxlIC0tbm93IG9zYnVpbGQtcmVtb3RlLXdvcmtlckAke0NPTVBPU0VSX0hPU1R9Ojg3MDAKCg==" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 6 -> (known after apply)
        id                      = "lt-0aae9d85fdd3f7067"
      ~ latest_version          = 6 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD05YjJkNTY1NTQ1NzUyMzM4NzQxYjNlMmFlYWY4NzM2N2UyM2E4MmQ0CkNPTVBPU0VSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTAuMzAuMTguMTEKT1NCVUlMRF9DQV9DRVJUPUxTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVVJFVkVORFFXWlhaMEYzU1VKQlowbFZVRE5RTTJZek5WQkdVazUxYjJaMGVtTTVURGsyUkdoVWIyUkJkMFJSV1VwTGIxcEphSFpqVGtGUlJVd0tRbEZCZDBacVJWVk5Ra2xIUVRGVlJVRjNkMHhpTTA1cFpGZHNjMXBETlhaamJXTjNTR2hqVGsxcVFYZFBWRVY2VFZSWmVVMUVWVE5YYUdOT1RYcEJkd3BQVkVWNFRWUlplVTFFVlROWGFrRlhUVkpSZDBWbldVUldVVkZFUkVGMGRtTXlTakZoVjNoclRHMDVlVnA2UTBOQlUwbDNSRkZaU2t0dldrbG9kbU5PQ2tGUlJVSkNVVUZFWjJkRlVFRkVRME5CVVc5RFoyZEZRa0ZOUW5CcldWRllTVk5NWXpoTFdXcE5VVmxuZW5CUk9VTkJNMUpMTW1kSVJEQnhZWEZ6ZGpnS1lWSmpWa00yTmxNNVpraHhSVVV4YVV4VldFODNNREpSZWpWemEycG9NM3B4VEhsSFVqaDNVbFl2TDJOSk1XSXhjakJWZVZwVFkweGFNMWMzVlZweVF3bzBORFJtWTNvelRYbDRiRk42VjFWWlUxQm5Ra2xMYUdkQk9IRnRjbHBTTVc5bVlXUnllSFZTVEN0emJrWkVTV3Q0TTNjcll6RktaVlZ1TW1Oc01GZHBDbFYwV0RKSFIxWkRSbGROVDJGdlprUnJXRlZEUm5WTFNIZEtVV2RHVEhSelNFTmFXV05tZGxkV1NGcGFOazQ0ZDBkd01sRmFXVEk1WXpoMWJYQnFNVkFLVUVac1dFTTRaR0ZhVEUxaFdGbGlSVEJOU1hSV01FTklTbkIzUjBsd1lubHViVmxVYkN0elJuVjJiRFJ2VkcxeWVIb3ZlWGg2Y0VSMlZrMVBja0ZKYlFwNGIyczNjbFZ0VkhWa1JHVkZVMUpDVDJkQk1VdDFZVTFTVkhWaFNYQlJiekprYjNaeEt6QXhSbVl6UVU0eVZVTkJkMFZCUVdGT1ZFMUdSWGRJVVZsRUNsWlNNRTlDUWxsRlJrbzNaVFpZTTNrd1pHOXNjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUNPRWRCTVZWa1NYZFJXVTFDWVVGR1NqZGxObGd6ZVRCa2Iyd0tjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUJPRWRCTVZWa1JYZEZRaTkzVVVaTlFVMUNRV1k0ZDBSUldVcExiMXBKYUhaalRrRlJSVXhDVVVGRVoyZEZRZ3BCUm5wMk4ybGxTMGM1YkZwTGNrSXlUVzFhYUVGeFNFbE1lV3hoVDNsV2NUYzNSemxDVFZKVVJuTndXblUwTUhJM1IxUjNZMFJvZG1nMVJVTnZTRkZpQ214cmRUQllOVTlZWjBSMldITkNjRzlHU0hKMk1FdFBTV3hUTjFWS01YWXdOR3N2U2xsbldIY3JiR3BVVkhNdk9YcHdiamhTVm14dGNIVXZSMDFQVFRVS1VXSkhVQ3RPYWpWYWN6Vm1SMFpYYUU0M1RUSTFVV3RWT0RKS2JIaGxTa0ZzVVhoSVEyeERVR1Y0VWtOTllURjVOWEEzVkc1bk9EQkxTbGQwZVZCUU9RcDBVMmROUW5BM05WVlNaVzgwTlVVNFVFcHlTbkF6YUhsdk5GSjRPVkpSUjJ0eWVXTlNTWGRtUWtoMmEzaE5TbVp1YzJNM1dTOTJOV2wxUmpodGVFMTZDak4wWWtvNUswcDVSVUYxU0hveFlrZDFjVU5ZSzNGS1VWUlVkQzlSYnpZeWRrZFhZVWs1VTFaTFlsTTRZVmhNUXpKT05uRmphV0p4Y2pVNFpqUkVTa1FLU25Oc1RTODNjSE41Y2pGdk5YUjBZa0p1TmxrMVFYTTlDaTB0TFMwdFJVNUVJRU5GVWxSSlJrbERRVlJGTFMwdExTMEsKV09SS0VSX1NTTF9LRVlTX0FSTj1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLWVhc3QtMTo5MzM3NTIxOTc5OTk6c2VjcmV0OmJyZXdfa2V5cy03RlVlZWwKCiMgVmFyaWFibGVzIGZvciB0aGUgc2NyaXB0LgpDT01QT1NFUl9ESVI9L2V0Yy9vc2J1aWxkLWNvbXBvc2VyCgojIEFkZCBtaGF5ZGVuJ3MgU1NIIGtleSB0ZW1wb3JhcmlseS4KY3VybCBodHRwczovL2dpdGh1Yi5jb20vbWFqb3Iua2V5cyA+PiAvaG9tZS9lYzItdXNlci8uc3NoL2F1dGhvcml6ZWRfa2V5cwoKIyBTZXQgdXAgL2V0Yy9ob3N0cwojIFRPRE8obWhheWRlbik6IFdlIG5lZWQgdG8gY29udmVydCB0aGlzIHRvIEROUyBsYXRlciB3aGVuIHdlIGxhdW5jaC4KY2F0IDw8PCAiJHtDT01QT1NFUl9BRERSRVNTfSAke0NPTVBPU0VSX0hPU1R9IiA+PiAvZXRjL2hvc3RzCgojIERlcGxveSB0aGUgY29tcG9zZXIgQ0EgY2VydGlmaWNhdGUuCm1rZGlyICR7Q09NUE9TRVJfRElSfQpiYXNlNjQgLWQgLSA8PDwgJHtPU0JVSUxEX0NBX0NFUlR9ID4gJHtDT01QT1NFUl9ESVJ9L2NhLWNydC5wZW0KCiMgRGVwbG95IHRoZSBjb21wb3NlciBrZXkgYW5kIGNlcnRpZmljYXRlLgovdXNyL2xvY2FsL2Jpbi9hd3Mgc2VjcmV0c21hbmFnZXIgZ2V0LXNlY3JldC12YWx1ZSBcCiAgLS1zZWNyZXQtaWQgJHtXT1JLRVJfU1NMX0tFWVNfQVJOfSB8IGpxIC1yICIuU2VjcmV0U3RyaW5nIiA+IC90bXAvd29ya2VyX2tleXMuanNvbgpqcSAtciAiLndvcmtlcl9rZXkiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1rZXkucGVtCmpxIC1yICIud29ya2VyX2NydCIgL3RtcC93b3JrZXJfa2V5cy5qc29uIHwgYmFzZTY0IC1kIC0gPiAke0NPTVBPU0VSX0RJUn0vd29ya2VyLWNydC5wZW0Kcm0gLWYgL3RtcC93b3JrZXJfa2V5cy5qc29uCgojIFByZXBhcmUgb3NidWlsZC1jb21wb3NlcidzIHJlbW90ZSB3b3JrZXIgc2VydmljZXMgYW5kIHNvY2tldHMuCnN5c3RlbWN0bCBlbmFibGUgLS1ub3cgb3NidWlsZC1yZW1vdGUtd29ya2VyQCR7Q09NUE9TRVJfSE9TVH06ODcwMAoK" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_lb.external_composer_lb will be created
  + resource "aws_lb" "external_composer_lb" {
      + arn                              = (known after apply)
      + arn_suffix                       = (known after apply)
      + dns_name                         = (known after apply)
      + enable_cross_zone_load_balancing = false
      + enable_deletion_protection       = false
      + id                               = (known after apply)
      + internal                         = (known after apply)
      + ip_address_type                  = (known after apply)
      + load_balancer_type               = "network"
      + name                             = "external-composer-lb-staging"
      + security_groups                  = (known after apply)
      + subnets                          = (known after apply)
      + tags                             = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "External Composer LB (staging)"
          + "ServiceOwner" = "Image Builder"
        }
      + vpc_id                           = (known after apply)
      + zone_id                          = (known after apply)

      + subnet_mapping {
          + allocation_id = "eipalloc-056acc0ea7b12456f"
          + outpost_id    = (known after apply)
          + subnet_id     = "subnet-0c016a02"
        }
    }

  # aws_lb_listener.external_composer will be created
  + resource "aws_lb_listener" "external_composer" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 9876
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.external_composer is tainted, so must be replaced
-/+ resource "aws_lb_target_group" "external_composer" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:933752197999:targetgroup/external-composer/9fe753c7237a096c" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/external-composer/9fe753c7237a096c" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:933752197999:targetgroup/external-composer/9fe753c7237a096c" -> (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
        name                               = "external-composer"
      ~ tags                               = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "External Composer Target Group (staging)"
          + "ServiceOwner" = "Image Builder"
        }
        # (8 unchanged attributes hidden)

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 3 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "TCP" -> (known after apply)
          ~ timeout             = 10 -> (known after apply)
          ~ unhealthy_threshold = 3 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 0 -> (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "source_ip" -> (known after apply)
        }
    }

  # aws_lb_target_group_attachment.external_composer will be created
  + resource "aws_lb_target_group_attachment" "external_composer" {
      + id               = (known after apply)
      + port             = 443
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210114220747690600000002" -> (known after apply)
      ~ id                                  = "sfr-dc578ae3-3d2d-4c48-96b9-699f00ab7cb4" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-04e6df10bd74694e7" -> null
              - version = "5" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-04e6df10bd74694e7"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210113212711575200000002" -> (known after apply)
      ~ id                                  = "sfr-3b3c9647-29f2-4dbd-be71-26305028634c" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0aae9d85fdd3f7067" -> null
              - version = "6" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0aae9d85fdd3f7067"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-1173148770" -> (known after apply)
      ~ instance_id = "i-08e50f4484ed22b9a" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-2907417618" -> (known after apply)
      ~ instance_id = "i-0a68c4943aff51cfe" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 10 to add, 2 to change, 7 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*